Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་གྱི་ཁམས་ཡངས་པ་དང་། དོག་པ་དང་། རྒྱ་ཆེན་པོ་དང་། ཚད་མྱེད་པ་དང་། ཕྲ་བ་དང་། ཆེ་བ་དང་། སྣྲེལ་ཞི་དང་། སྦྱིའུ་ཚུགས་སུ་རྒྱུ་བ་ཐམས་ཅད་མ་ལུས་པ་ལྷག་མ་མྱེད་པ་མཐའ་དག་གཞི་མཉམ་པར་ཡང་དག་པར་འཇུག་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། མྱིག་འཕྲུལ་གྱི་རྣམ་པ་ལྟར་ཕྱོགས་བཅུའི་རྣམ་པ་ཐ་དད་པ་མ་ལུས་པའི་རྣམ་པ་ལ་འཇུག་པ། རྣམ་པར་ཕྱེ་བའི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་ཅིང་། མངོན་དུ་འགྱུར་བར་བྱ་བའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་རྒྱ་ཆེ་བ། ནམ་མཁའི་དབྱིངས་ཀྱི་མཐར་ཐུག་པ། ཕྱི་མའི་མཐའི་མུར་ཐུག་པ། བསྐལ་པ་འགྲངས་པ་ཐམས་ཅད་དུ། འཇིག་རྟེན་གྱི་ཁམས་འགྲངས་པར་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ལ་འཇུག་ཅིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར། སྨོན་ལམ་ཆེན་པོ་མངོན་པར་སྒྲུབ་བོ།
en: “In order that his miraculous emanations may enter equally and separately into every assembly in every single world in the ten directions while having the wisdom that perceives their dissimilarities—the wide worlds and the narrow, the vast and immeasurable, the subtle and the gross, the inverted and the upside down—the bodhisattva continuously makes great prayers, perfect in all aspects, that have the complete purity of a vast aspiration, are as vast as the realm of phenomena, reach the ends of space, and extend to the end of time, so that he may throughout all eons enter those worlds for the sake of purification.

source: ཞིང་ཐམས་ཅད་ཞིང་གཅིག་ཏུ་ཡང་དག་པར་གཞོལ་བར་བྱ་བ་དང་། ཞིང་གཅིག་ཞིང་ཐམས་ཅད་དུ་ཡང་དག་པར་གཞོལ་བར་བྱ་བ་དང་། ཡོངས་སུ་སྦྱང་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་འོད་མང་པོའི་རྒྱན་གྱིས་རབ་ཏུ་བརྒྱན་པར་བྱ་བ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་བསྩལ་བས། ཡོངས་སུ་དག་པའི་ལམ་དང་ལྡན་པ་དང་། སེམས་ཅན་ཡེ་ཤེས་ཀྱི་འབྱུང་གནས་ཚད་མེད་པས་ཡོངས་སུ་གང་བའི་སངས་རྒྱས་ཀྱི་ཡུལ་རྒྱ་ཆེན་པོ་ལ་ཡང་དག་པར་གཞོལ་ཞིང་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། བསམ་པའི་ཚུལ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་བསྟན་ཅིང་ཤིན་ཏུ་ཚིམ་པར་བྱ་བའི་ཕྱིར། ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་རྒྱ་ཆེ་བ་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐར་ཐུག་པ། ཕྱི་མའི་མཐའི་མུར་ཐུག་པ། བསྐལ་པ་འགྲངས་པ་ཐམས་ཅད་དུ་ཞིང་འགྲང་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་རྒྱུན་མི་འཆད་པའི་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་སྒྲུབ་བོ།
en: “In order for all purified realms to be in one realm and one realm in all realms, for there to be limitless purified buddha realms, beautified by adorning arrays of a multitude of lights, where there is the attainment of the path of purification that removes all kleśas, realms that are filled by countless beings who are the source of wisdom and that are the entirety of the vast fields of activity of the buddhas that satisfy with teachings the wishes of beings, the bodhisattva continuously makes great prayers, perfect in all aspects, that have the complete purity of a vast aspiration, are as vast as the realm of phenomena, reach the ends of space, and extend to the end of time, so that he may throughout all eons purify buddha realms.

source: །འདི་ལྟ་སྟེ།
en: “In order to be dedicated to the one intention of all bodhisattvas; in order to individually accumulate the roots of goodness; in order to have the same goal as all bodhisattvas; in order to be always inseparably accompanied by bodhisattvas; in order for the buddhas to teach him whatever he wishes;

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་བསམ་པ་གཅིག་ཕའི་སྦྱོར་བ་དང་། ལྟོད་པ་མེད་པའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་བསྩགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་དམྱིགས་པ་གཅིག་ཅིང་མཉམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་འགྲོགས་ཤིང་མྱི་འབྲལ་བ་དང་། སངས་རྒྱས་འབྱུང་བ་ཅི་དགར་བསྟན་པ་དང་། རང་གི་སེམས་བསྐྱེད་པས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུལ་དང་། མཐུ་དང་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། མཉམས་ཤིང་རྗེས་སུ་འབྲང་བའི་མངོན་པར་ཤེས་པ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་རྣམ་པར་རྒྱུ་བར་བྱ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་གཟུགས་བརྙན་འབྱུང་བ་ཡང་དག་པར་བསྟན་པ་དང་། སྐྱེ་བའི་སྐྱེ་གནས་ཐམས་ཅད་དུ་རང་གི་ལུས་རྗེས་སུ་འགྲོ་བར་བྱ་བ་དང་། ཐེག་པ་ཆེན་པོ་བསམ་གྱིས་མྱི་ཁྱབ་པ་དང་ལྡན་པའི།
en: in order to obtain, through his motivation to buddhahood, the scope, power, and wisdom of all the tathāgatas; in order to attain imperishable, ever-present clairvoyance; in order to move throughout all worlds; in order for his form to appear among the assembled pupils of all buddhas and for all buddhas to teach him; in order for his bodies to continue in all his rebirths; in order to obtain the inconceivable Mahāyāna;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་སྤྱད་པ་རྒྱུན་མི་འཆད་པའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་རྒྱ་ཆེ་བ། ནམ་མཁའི་དབྱིངས་ཀྱི་མཐར་ཐུག་པ། ཕྱི་མའི་མཐའི་མུར་ཐུག་པ། བསྐལ་པ་འགྲངས་པ་ཐམས་ཅད་དུ། སྤྱོད་པ་འགྲངས་པར་ཐེག་པ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པ་ལ་རྒྱུན་མི་འཆད་པའི་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་སྒྲུབ་བོ།
en: and in order to have the uninterrupted practice of bodhisattva conduct, the bodhisattva continuously makes great prayers, perfect in all aspects, that have the complete purity of a vast aspiration, are as vast as the realm of phenomena, reach the ends of space, and extend to the end of time, so that he may throughout all eons accomplish the Mahāyāna in all his conduct.

source: ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་ལ་ཡང་དག་པར་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པ་དང་། ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་དོན་ཡོད་པར་བྱ་བ་དང་། མཐོང་མ་ཐག་ཏུ་སངས་རྒྱས་ཀྱི་ཆོས་གདོན་མི་ཟ་བར་འཐོབ་པར་བྱ་བ་དང་། དབྱངས་བརྗོད་མ་ཐག་ཏུ་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། དད་པར་གྱུར་མ་ཐག་ཏུ་ཉོན་མོངས་པ་ཕྱིར་མི་ལྡོག་པར་བྱ་བ་དང་། བསམ་པ་སྨན་གྱི་རྒྱལ་པོ་ཆེན་པོ་ལྟ་བུ་རབ་ཏུ་ཐོབ་པར་བྱ་བ་དང་། ལུས་ཡིད་བཞིན་གྱི་ནོར་བུ་ལྟ་བུ་འཐོབ་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་སྤྱད་པའི་ཕྱིར་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་རྒྱ་ཆེ་བ།
en: “In order to practice the sublime bodhisattva conduct that resides within the irreversible wheel; in order for there to be the fruitful activities of body, speech, and mind that bring conviction in the Buddhadharma as soon as the body is seen, that bring attainment of wisdom as soon as the voice speaks, and that bring freedom from kleśas as soon as there is faith; in order to attain the motivation that is like the great king of medicines; in order to attain a body that is like a wish-fulfilling jewel;

source: ནམ་མཁའི་དབྱིངས་ཀྱི་མཐར་ཐུག་པ། ཕྱི་མའི་མཐའི་མུར་ཐུག་པ། བསྐལ་པ་འགྲངས་པ་ཐམས་ཅད་དུ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་འགྲངས་པར་སྤྱོད་པ་ཐམས་ཅད་འབྲས་བུ་ཡོད་པ་རྒྱུན་མི་འཆད་པའི་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་སྒྲུབ་བོ།
en: and in order to practice all the conduct of the bodhisattvas, the bodhisattva continuously makes great prayers, perfect in all aspects, that have the complete purity of a vast aspiration, are as vast as the realm of phenomena, reach the ends of space, and extend to the end of time, so that throughout all eons all his practice of the wheel of irreversibility will be fruitful.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བ་དང་། སྐྲའི་སྦུབས་གཅིག་དང་ཐ་མི་དད་པའི་སྐྲའི་སྦུབས་ཐམས་ཅད་དུ་ཚེ་དང་སྐྱེ་བ་དང་། གཞོན་ནུ་རོལ་པ་དང་། བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་པ་དང་། མངོན་པར་འབྱུང་བ་དང་རྣམ་པར་འཕྲུལ་པ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་པ་དང་། བདུད་འདུལ་བ་དང་མངོན་པར་འཚང་རྒྱ་བ་དང་། གསོལ་བ་གདབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་བསྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཆེན་པོ་བསྟན་པ་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་དང་མཐུ་དང་ཡེ་ཤེས་ཆེན་པོ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སངས་རྒྱས་འབྱུང་བ་དང་། སྐད་ཅིག་གཅིག་ཏུ་མངོན་པར་འཚང་རྒྱ་བ་དང་། རབ་ཏུ་ཞི་བ་ཐོབ་པར་བྱ་བ་ཡང་དག་པར་བསྟན་པ་དང་། མངོན་པར་འཚང་རྒྱ་བ་གཅིག་གིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་འཕྲུལ་པས་རྒྱས་པར་དགང་པ་དང་། དབྱངས་གཅིག་བརྗོད་པས་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་དང་། བསམ་པ་ཤིན་ཏུ་ཚིམ་པར་བྱ་བ་དང་། མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་ཡོངས་སུ་བསྟན་པ་དང་། སྤྱོད་པ་རྣམས་རྒྱུན་མི་འཆད་པར་བྱ་བ་དང་། ཐེག་པ་ཆེན་པོའི་ས་ལ་ཆོས་ཐམས་ཅད་རྣམ་པར་དགོད་པ་ཡང་དག་པར་བསྟན་པ་དང་། ཆོས་ཤེས་པའི་རྫུ་འཕྲུལ་གྱི་རྒྱུ་དང་། མངོན་པར་ཤེས་པ་དང་དབང་གིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་སྤྲུལ་པས་རྣམ་པར་དགང་བའི་ཕྱིར།
en: “In order to attain buddhahood, unsurpassable complete enlightenment, in all worlds; in order that there will be, for each childlike being without a hairsbreadth of difference, birth, enjoying youth, living with a retinue of queens, abandoning the lay life, practicing asceticism, going to the bodhimaṇḍa, subjugating the māras, attaining buddhahood, receiving a supplication, turning the great Dharma wheel, and demonstrating passing into the great nirvāṇa; in order to obtain the Buddha’s great scope, powers, and wisdom; in order to manifest as a buddha in all the realms of beings in accordance with his wishes, and in each instant manifest buddhahood and the attainment of peace; in order that one buddhahood will fill the entire expanse of phenomena with emanations; in order that speaking in one voice will completely satisfy the minds and wishes of all the realms of beings; in order to manifest passing into the great nirvāṇa and the continuous practice of conduct;

source: ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པར་རྒྱ་ཆེ་བ། ནམ་མཁའི་དབྱིངས་ཀྱི་མཐར་ཐུག་པ། ཕྱི་མའི་མཐའི་མུར་ཐུག་པ། བསྐལ་པ་འགྲངས་པ་ཐམས་ཅད་དུ་མངོན་པར་འཚང་རྒྱ་བ་འགྲངས་པར་ཡེ་ཤེས་ཆེན་པོའི་མངོན་པར་ཤེས་པ་རྒྱུན་མི་འཆད་པའི་སྨོན་ལམ་ཆེན་པོ་མངོན་པར་སྒྲུབ་བོ།
en: in order to teach the presentation of all the qualities in the bhūmis of great wisdom; and in order to emanate throughout all worlds the clairvoyance that is the power of the Dharma of wisdom, the bodhisattva continuously makes great prayers, perfect in all aspects, that have the complete purity of a vast aspiration, are as vast as the realm of phenomena, reach the ends of space, and extend to the end of time, so that he may throughout all eons have the clairvoyance of great wisdom in the attainment of buddhahood.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་རྣམ་པ་འདི་ལྟ་བུའི་སྨོན་ལམ་ཆེན་པོ་དང་། བརྩོན་འགྲུས་ཆེན་པོ་དང་། མངོན་པར་བསྒྲུབ་པ་ཆེན་པོའི་སྨོན་ལམ་གྱི་སྒོ་བཅུ་པོ་འདི་དག་ལས་སྩོགས་པ།
en: “O jinaputras! Those are their great prayers, great scope, and great diligence.

source: སྨོན་ལམ་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་ཚང་བ་དག །བྱང་ཆུབ་སེམས་དཔའི་ས་རབ་ཏུ་དགའ་བ་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔས་ཐོབ་བོ། །མངོན་པར་སྒྲུབ་བོ།
en: They make these ten doorways of prayer, and the bodhisattva on the Perfect Joy bodhisattva bhūmi fulfills these ten prayers countless hundreds of thousands of times.

source: །སྨོན་ལམ་དེ་དག་ཀྱང་མཐར་ཐུག་པའི་གནས་བཅུས་མངོན་པར་བསྒྲུབ་སྟེ།
en: “These ten great prayers have ten conclusions.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these ten?

source: སེམས་ཅན་གྱི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། ནམ་མཁའི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། ཆོས་ཀྱི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། མྱ་ངན་ལས་འདས་པའི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། སངས་རྒྱས་འབྱུང་བའི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། སེམས་ཀྱི་དམྱིགས་པའི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པའི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དང་། འཇིག་རྟེན་གྱི་རྒྱུད་དང་། ཆོས་ཀྱི་རྒྱུད་དང་། ཡེ་ཤེས་ཀྱི་རྒྱུད་ཀྱི་ཁམས་ཀྱི་མཐར་ཐུག་པ་དག་གོ། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཅུ་བཞི་པ།
en: They are (1) the conclusion of beings, ( ) the conclusion of worlds, (3) the conclusion of space, (4) the conclusion of phenomena, (5) the conclusion of nirvāṇa, (6) the conclusion of the appearance of buddhas, (7) the conclusion of the wisdom of the tathāgatas, (8) the conclusion of the mind’s objectives, (9) the conclusion of entering the wisdom of buddhahood, and (10) the conclusion of the continuation of worlds, the continuation of the Dharma, and the continuation of wisdom.

source: དེ་ལྟར་སྨོན་ལམ་ཆེན་པོ་འདི་དག་སེམས་ཅན་གྱི་ཁམས་ཀྱི་མཐར་གང་དུ་ཐུག་པ་དེའི་མཐར་ཐུག་པར་གྱུར་ཅིག །སྨོན་ལམ་ཆེན་པོ་འདི་དག་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་མཐའ་གང་དུ་ཐུག་པ་དང་། ནམ་མཁའི་ཁམས་དང་ཆོས་ཀྱི་ཁམས་དང་། མྱ་ངན་ལས་འདས་པའི་ཁམས་དང་། སངས་རྒྱས་འབྱུང་བའི་ཁམས་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཁམས་དང་། སེམས་ཅན་གྱི་དམྱིགས་པའི་ཁམས་དང་། ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པའི་ཁམས་དང་། འཇིག་རྟེན་གྱི་རྒྱུད་དང་། ཆོས་ཀྱི་རྒྱུད་དང་། ཡེ་ཤེས་ཀྱི་རྒྱུད་ཀྱི་ཁམས་ཀྱི་མཐའ་གང་དུ་ཐུག་པ།
en: “He makes a perfect prayer, saying, ‘In that way, may the conclusion of these great prayers of mine be at the end of (1) beings, ( ) worlds, (3) space, (4) phenomena, [386] (5) nirvāṇa, (6) the appearance of the buddhas, (7) the wisdom of the tathāgatas, (8) the mind’s objectives, (9) the accomplishment of wisdom, (10) the continuity of worlds, the continuity of the Dharma, and the continuity of wisdom. (1) Just as there is no end to beings, may my roots of goodness never be concluded.

source: དེའི་མཐར་ཐུག་པར་གྱུར་ཅིག །འདི་ལྟར་སེམས་ཅན་གྱི་ཁམས་མཐར་ཐུག་པ་མེད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་དང་ནམ་མཁའི་ཁམས་དང་། ཆོས་ཀྱི་ཁམས་དང་མྱ་ངན་ལས་འདས་པའི་ཁམས་དང་། སངས་རྒྱས་འབྱུང་བའི་ཁམས་དང་། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་ཁམས་དང་། སེམས་ཅན་གྱི་དམྱིགས་པའི་ཁམས་དང་། ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པའི་ཁམས་དང་། འཇིག་རྟེན་གྱི་རྒྱུད་དང་། ཆོས་ཀྱི་རྒྱུད་དང་། ཡེ་ཤེས་ཀྱི་རྒྱུད་ཀྱི་ཁམས་མཐར་ཐུག་པ་མེད་པ་དེ་བཞིན་དུ་སྨོན་ལམ་ཆེན་པོ་འདི་དག་ཀྱང་མཐར་ཐུག་པ་མྱེད་པར་གྱུར་ཏེ། བདག་གི་དགེ་བའི་རྩ་བ་འདི་དག་ཀྱང་། མཐར་ཐུག་པ་མྱེད་པར་གྱུར་ཅིག་ཅེས་དེ་ལྟར་སྨོན་ལམ་ཤིན་ཏུ་བསྒྲུབས་ཤིང་ཕན་པའི་སེམས་དང་ལྡན་པ། འཇམ་པའི་སེམས་དང་ལྡན་པ། ལས་སུ་རུང་བའི་སེམས་དང་ལྡན་པ། ཞི་བའི་སེམས་དང་ལྡན་པ།
en: ) Just as there is no end to worlds, (3) space, (4) phenomena, (5) nirvāṇa, (6) the appearance of buddhas, (7) the wisdom of the tathāgatas, (8) the mind’s objectives, (9) the accomplishment of wisdom, and (10) the continuity of worlds, the continuity of the Dharma, and the continuity of wisdom, may my roots of goodness never be concluded!’

source: དུལ་བའི་སེམས་དང་ལྡན་པ། ཉེ་བར་ཞི་བའི་སེམས་དང་ལྡན་པ། མཉེན་པའི་སེམས་དང་ལྡན་པ། བྱམས་པའི་སེམས་དང་ལྡན་པ། འཁྲུགས་པ་མེད་པའི་སེམས་དང་ལྡན་པ།
en: “He makes that prayer with (1) an altruistic mind, ( ) a gentle mind, (3) an adept mind, (4) a peaceful mind, (5) a tamed mind, (6) a deeply peaceful mind, (7) a flexible mind, (8) a loving mind, (9) an undisturbed mind, and (10) an untroubled mind.

source: གློང་བ་མེད་པའི་སེམས་དང་ལྡན་པ་དེ་ནི་ལེགས་པར་རྟོག་པ་མང་ཞིང་དད་པ་དང་ལྡན་པ་ཡིན་ཏེ།
en: “He has many excellent realizations and has faith:

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སྔོན་གྱི་མཐའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབས་པའི་རྒྱུད་ལ་ཡིད་ཆེས་པ་ཡིན།
en: (1) He has faith in the accomplishment of conduct by all the previous tathāgata arhat bhagavat samyak­sambuddhas.

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་བསྡུ་བ་ལ་ཡིད་ཆེས་པ་ཡིན།
en: ) He has faith in their attainment of the perfections.

source: ས་ཡང་དག་པར་བསྒྲུབ་པ་དང་། ཁྱད་པར་དུ་འགྱུར་བ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན།
en: (3) He has faith in their attainment of the various bhūmis.

source: སྟོབས་ཡོངས་སུ་འགྲུབ་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན།
en: (4) He has faith in their accomplishment of the strengths.

source: མི་འཇིགས་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན།
en: (5) He has faith in their perfection of the confidences.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་མི་འཕྲོགས་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན།
en: (6) He has faith in their unsurpassable, unique buddha qualities.

source: སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན། སངས་རྒྱས་ཀྱི་ཡུལ་མཐའ་དང་དབུས་མེད་པ་མངོན་པར་བསྒྲུབ་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན།
en: (7) He has faith in their inconceivable buddha qualities. (8) He has faith in their accomplishment of the purview of a buddha, which has no center or edge.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ཡུལ་ཚད་མེད་པའི་རྗེས་སུ་སོང་བའི་རྗེས་སུ་འཇུག་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན།
en: (9) He has faith in their entering and following the immeasurable scope of activity of the tathāgatas.

source: འབྲས་བུ་ཡོངས་སུ་གྲུབ་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན་ཏེ།
en: (10) He has faith in their accomplishment of the result.

source: མདོར་བསྡུ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་ས་དང་། ཡེ་ཤེས་ཀྱི་བར་དུ་ཤིན་ཏུ་བསྟན་པའི་བྱིན་གྱི་རླབས་ལ་མངོན་པར་ཡིད་ཆེས་པ་ཡིན་ནོ། །ཡང་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “In brief, they have faith in all bodhisattva conduct and so on, up to the authority of the teaching on the wisdom of the bhūmi of the tathāgatas.

source: སངས་རྒྱས་ཀྱི་ཆོས་འདི་དག་དེ་ལྟར་རྒྱ་ཆེ་ཞིང་དེ་ལྟར་ཟབ་ལ་དེ་ལྟར་དབེན་ཞིང་དེ་ལྟར་ཞི་བ་སྟེ། དེ་ལྟར་སྟོང་ལ་དེ་ལྟར་མཚན་མ་མེད་ཅིང་དེ་ལྟར་སྨོན་པ་མྱེད་ལ།
en: “He thinks, ‘These buddha qualities are thus (1) vast, ( ) profound, (3) singular, (4) peaceful, (5) empty, (6) featureless, (7) aspirationless, (8) desireless, (9) stainless , and (10) limitless, and these buddha qualities are difficult to attain. However, these children, these ordinary beings, have (1) minds that have fallen into bad views and the thick darkness of ignorance and dimmed sight, which obscures their minds. ( ) They have thoughts that raise the victory banner of pride.

source: དེ་ལྟར་ཆགས་པ་མེད་དེ།
en: (3) Their minds are never satisfied. (4) They are caught in the net of craving. (5) They have minds that engage in the darkness of deceit and deception.

source: །དེ་ལྟར་གོས་པ་མྱེད་ཅིང་དེ་ལྟར་ཚད་མེད་ལ་སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་དེ་ལྟར་རླབས་ཆེན་འོན་ཀྱང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་འདི་དག་ལྟ་བ་ངན་པར་ལྟུང་བའི་རྒྱུད་དང་། མ་རིག་པའི་མུན་ནག་དང་། རབ་རིབ་ཐིབས་པོས་ཀུན་ནས་ཁེབས་པའི་ཡིད་དང་། ང་རྒྱལ་གྱི་རྒྱལ་མཚན་ཤིན་ཏུ་བསྒྲེངས་པའི་ཡོངས་སུ་རྟོག་པ་དང་། སྲེད་པའི་དྲ་བས་མངོན་པར་ཡེ་རྔམ་པའི་ཡིད་ལ་བྱ་བ་དང་། སྒྱུ་དང་གཡོའི་ཐིབས་པོ་ལ་རྗེས་སུ་སྤྱོད་པའི་སེམས་དང་། བསམ་པ་དང་ཕྲག་དོག་དང་འཇུངས་པ་ཅན་གྱི་ཀུན་ནས་འཁོར་བས་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བའི་ཀུན་ཏུ་འབྲེལ་བ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ལ་སྤྱོད་པའི་ལས་ཤིན་ཏུ་བསྩགས་པ་དང་། ཁྲོ་བ་དང་ཁོན་དུ་འཛིན་པས་འབར་བར་བྱས་པའི་སེམས་ཀྱི་མེ་ལྕེ་དང་། ཕྱིན་ཅི་ལོག་དང་བཅས་པའི་ལས་མངོན་པར་བསྒྲུབ་པ་དང་། འདོད་པ་དང་སྲེད་པའི་མ་རིག་པ་དང་། ལྟ་བ་དང་ཀུན་ཏུ་ཟབ་པའི་བག་ཆགས་མཚམས་འབྲེལ་བའི་སེམས་དང་། ཡིད་དང་རྣམ་པར་ཤེས་པའི་ས་བོན་གྱིས་འདི་ལྟ་སྟེ།
en: (6) They are completely encircled by thoughts of envy and avarice, so that within the continuum of the path they are completely connected to birth. (7) They accumulate karma from being engaged in desire and hatred and ignorance. (8) Their anger and enmity create a blazing fire in their minds. (9) They perform erroneous actions. (10) They have the seeds of minds, mentation, and consciousnesses that are under the influence of ignorance and the view of desire and becoming.

source: ཁམས་གསུམ་དུ་མིང་དང་གཟུགས་ལྷན་ཅིག་ཏུ། སྐྱེས་ཤིང་ཐ་མི་དད་པར་བྱུང་བའི་ཡང་སྐྱེ་བའི་སྡུག་བསྔལ་གྱི་མྱུ་གུ་མངོན་པར་སྐྱེད་དོ།
en: They generate the seedling of the suffering of rebirth as the simultaneous birth and inseparable arising of name-and-form in the three realms.

source: །མྱིང་དང་གཟུགས་དེ་རྣམ་པར་འཕེལ་ནས་སྐྱེ་མཆེད་དྲུག་གི་ཚོགས་འབྱུང་བར་འགྱུར་རོ།
en: That name-and-form increases so that the collection of the six bases of sensory perception is created.

source: །སྐྱེ་མཆེད་རྣམས་བྱུང་བས་ཕན་ཚུན་རེག་པ་དང་ཕྲད་ཅིང་འདུས་པས་ཚོར་བ་མངོན་པར་འབྱུང་ངོ་།
en: When the bases of sensory perception have appeared there occur the sensations from their mutual contact and combining.

source: །ཚོར་བ་མྱོང་བ་དེ་ཉིད་ལ་ཡང་དང་ཡང་མངོན་པར་དགའ་བས་སྲེད་པ་དང་ཉེ་བར་ལེན་པ་རྣམ་པར་འཕེལ་ལོ།
en: When there is the repeated enjoyment of sensation, craving and grasping increase.

source: །ཉེ་བར་ལེན་པ་རྣམ་པར་འཕེལ་བས།
en: Through the increase of that grasping there occurs becoming.

source: སྲིད་པ་ཀུན་ཏུ་འབྱུང་ངོ་། །སྲིད་པ་ཀུན་ཏུ་འབྱུང་བས་སྐྱེ་བ་དང་། རྒ་ཤི་དང་། མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་དང་། ཡིད་མྱི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཀྱང་འབྱུང་བར་འགྱུར་ཏེ།
en: When becoming has occurred, there is the manifestation of birth, old age, death, misery, wailing, suffering, unhappiness, and disturbances of mind.

source: དེ་ལྟར་སེམས་ཅན་དེ་དག་གི་སྡུག་བསྔལ་གྱི་ཕུང་པོ་བདག་དང་བདག་གི་མྱེད་པ། གསོབ་གསོག་སྟོང་བ་བྱེད་པ་མྱེད་པ། སེམས་མེད་པ་རྩ་དང་ཤིང་དང་། རྩིག་པ་དང་། སྒང་སྒོང་དང་མིག་ཡོར་ལྟ་བུ་མངོན་པར་འབྱུང་བ་ཡང་དེ་ལྟར་ཁོང་དུ་མྱི་ཆུད་དོ་ཞེས།
en: A mass of suffering is created in that way for those beings, while plants, trees, walls, wheel tracks, illusions, and the like are devoid of me and mine , and they are vacant, hollow, empty, inactive, motionless, and inanimate and therefore do not have that kind of awareness.’

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཅན་དེ་དག་དེ་ལྟར་སྡུག་བསྔལ་གྱི་ཕུང་པོ་དང་འབྲལ་མི་མྱོང་བ་མཐོང་ནས། དེའི་ཕྱིར་དེའི་སྙིང་རྗེ་ཆེན་པོ་རྒྱས་པར་འབྱུང་སྟེ།
en: “When the bodhisattva sees that those beings are not free from that mass of suffering, great compassion arises in him for those beings.

source: སེམས་ཅན་འདི་དག་ནི་བདག་གིས་ཡོངས་སུ་བསྐྱབ་པར་བྱ་བ་དག་གོ །ཡོངས་སུ་དགྲོལ་བར་བྱ་བ་དག་གོ །ཤིན་ཏུ་བདེ་བ་ལ་དགོད་པར་བྱ་བ་དག་གོ་སྙམ་སྟེ། དེའི་ཕྱིར་དེའི་བྱམས་པ་ཆེན་པོ་རྒྱས་པར་འབྱུང་ངོ་།
en: He thinks, ‘I shall protect these beings, liberate them, and bring them to ultimate happiness,’ and great love develops within him.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་དང་བྱམས་པ་དེ་ལྟ་བུའི་རྣམ་པ་དང་ལྡན་པའི་ལྷག་པའི་བསམ་པས་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་ལ་གནས་པའི་ཚེ།
en: “O jinaputras! The bodhisattva who is on the first bodhisattva bhūmi is endowed with that kind of compassion and love, that superior motivation.

source: དངོས་པོ་ཐམས་ཅད་ལ་ཕངས་པར་སེམས་པའི་སེམས་ཡོངས་སུ་སྤངས་ནས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མོས་པ་དང་། དད་པ་རླབས་པོ་ཆེའི་བློས་སྦྱིན་པ་ཆེན་པོ་ལ་རབ་ཏུ་བརྩོན་པར་བྱེད་དེ། དེ་འདི་ལྟར་འདི་ལྟ་སྟེ།
en: He has rejected the mind that is directed toward all things, aspires to the wisdom of buddhahood, and with a mind with powerful faith is dedicated to great generosity in the following way:

source: ནོར་དང་། འབྲུའི་མཛོད་དང་། བང་བ་ཡོངས་སུ་གཏང་བར་བྱ་བ་དག་གམ།
en: He gives away wealth, stores of grain, and property.

source: གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་ཌཱུརྱ་དང་། རིན་པོ་ཆེ་ཤི་ལ་དང་། བྱི་རུ་དང་། དངུལ་དང་། ས་ལེ་སྦྲམ་ཡོངས་སུ་གཏང་བར་བྱ་བ་འམ།
en: He gives away pure gold, jewels, pearls, beryls, conch, coral, and gold or silver coins. He gives away precious jewelry and ornaments.

source: རིན་པོ་ཆེའི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཡོངས་སུ་གཏང་བ་འམ་རྟ་དང་། གླང་པོ་དང་། ཤིང་རྟ་དང་རྐང་ཏང་དང་། བཞོན་པ་ཡོངས་སུ་གཏང་བ་འམ།
en: He gives away horses, elephants, chariots, drivers, and steeds.

source: བྲན་ཕོ་དང་། བྲན་མོ་ཡོངས་སུ་གཏད་བ་འམ།
en: He gives away male servants and female servants.

source: གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་། ཕོ་བྲང་འཁོར་དང་། རྒྱལ་པོའི་གནས་ཡོངས་སུ་གཏང་བའམ།
en: He gives away villages, towns, lands, palaces, and capitals.

source: བཟའ་ཤིང་གི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་དང་། གཙུག་ལག་ཁང་ཡོངས་སུ་གཏང་བའམ།
en: He gives away parks of fruit tree orchards, groves for ascetics, and temples.

source: ཆུང་མ་དང་བུ་དང་བུ་མོ་ཡོངས་སུ་གཏང་བའམ།
en: “He gives away wives, sons, and daughters.

source: སྡུག་ཅིང་ཡིད་དུ་འོང་བའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བའམ།
en: He gives away all beautiful and pleasant things.

source: མགོ་དང་རྣ་བ་དང་རྐ་ལག་དང་མྱིག་དང་ཡན་ལག་གི་དམ་པ་དང་། ལུས་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་འམ།
en: He gives away his head, ears, nose, hands, feet, and eyes, his limbs, and his entire body.

source: གཏང་བར་བྱ་བའི་དངོས་པོ་དེ་དག་ཐམས་ཅད་ལ་ཆགས་པ་མྱེད་པར་བྱས་ནས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་དད་པ་དང་། མོས་པའི་བློས་ཡོངས་སུ་གཏོང་སྟེ།
en: He has no attachment to any of those things he gives away, and he gives them away with a mind that has faith in and aspiration for the wisdom of the Buddha.

source: དེ་ལྟར་དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་དང་པོ་འདི་ལ་གནས་པའི་ཚེ་གཏོང་བ་ཆེན་པོ་རབ་ཏུ་བྱེད་དོ།
en: “Thus he practices great generosity when he is on the first bodhisattva bhūmi.

source: །དེ་དེ་ལྟར་བྱམས་པ་དང་སྙིང་རྗེ་དང་གཏོང་བའི་བསམ་པ་དང་ལྡན་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་ཕྱིར་ཡང་དང་ཡང་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་དོན་ཡོངས་སུ་ཚོལ་ཞིང་དོན་དུ་གཉེར་ཏོ། །དེ་དེ་ལྟར་ཡོངས་སུ་ཚོལ་ཞིང་དོན་དུ་གཉེར་བའི་ཚེ།
en: “In that way he has a motivation of compassion, love, and generosity, and in order to protect all beings more than ever before he is intently engaged in seeking both worldly and transcendent benefits.

source: ཡོངས་སུ་སྐྱོ་བའི་སེམས་མི་སྐྱེ་སྟེ། དེའི་ཕྱིར་དེའི་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་མངོན་པར་འབྱུང་ངོ་།
en: He is indefatigable when he intently engages in seeking those benefits, and he therefore has indefatigability.

source: །ཡོངས་སུ་སྐྱོ་བ་མེད་པས་གཙུག་ལག་ཐམས་ཅད་ལ་འཇིགས་པ་མེད་པ་ཡིན།
en: As he is indefatigable, he becomes proficient in all learning.

source: དེའི་ཕྱིར་དེ་གཙུག་ལག་ཐམས་ཅད་ལ་རབ་ཏུ་ཤེས་པ་ཡིན་ཏེ།
en: Therefore, he becomes one who knows all learning.

source: དེ་དེ་ལྟ་བུའི་གཙུག་ལག་དང་ལྡན་པས་བྱ་བ་དང་མྱི་བྱ་བ་ཤིན་ཏུ་རྟོགས་པའི་བློས་སེམས་ཅན་རབ་འབྲིང་དང་ཐ་མ་ལ་དད་པའི་ཚུལ་ཇི་ལྟ་བ་དང་། ཅི་འོས་པས་ཅི་ནུས་སུ་སྙིང་ཐག་པ་ནས་ཡང་དག་པ་ཉིད་ཐོབ་པར་བྱ་བའི་ཕྱིར་བརྩོན་པར་བྱེད་དོ།
en: As someone who has obtained learning in that way, with the understanding of what is to be done and not to be done, he behaves appropriately toward higher, middling, and lower levels of beings according to his own power and their suitability. Therefore he knows the world.

source: །ནན་ཏན་དུ་བྱེད་དོ། དེའི་ཕྱིར་དེ་འཇིག་རྟེན་ཤེས་པ་ཡིན་ཏེ།
en: Because he knows the world he acts in accord with the times.
